Revit 2027 API
PrintManager.SubmitPrint Method
Print with the current PrintManager settings.
Overload List
Name | Description
SubmitPrint() |  Print the views and sheets defined in the current local PrintManager settings.
SubmitPrint(View) |  Print a view with the current PrintManager settings.
Top
See Also
Reference
PrintManager Class
Autodesk.Revit.DB Namespace